Documents/Согласование_ат.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<Document>
		<Properties>
			<Name>Согласование_ат</Name>
			<Comment>!!!!!HOTFIX</Comment>
			<BasedOn>
				<xr:Item>Document.Заявка_ат</xr:Item>
				<xr:Item>Document.ФиксацияРабот_ат</xr:Item>
				<xr:Item>Document.Согласование_ат</xr:Item>
			</BasedOn>
			<Posting>Deny</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.СоответствияСодержанийРаботВоВнутреннихСогласованиях_ат</xr:Item>
				<xr:Item>AccumulationRegister.ВременаРабот_ат</xr:Item>
				<xr:Item>AccumulationRegister.КоличественноСуммовойУчетРабот_ат</xr:Item>
				<xr:Item>AccountingRegister.Клиентский_ат</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВнешнийНомер</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ТипВнешнегоНомера_ат</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВремяНаСогласование</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОтправкиНаСогласование</Name>
					<Comment>!!!TODO - rename2 ДатаОтправки</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаСогласования</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаСоздания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Договор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Договоры_ат</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Заявка</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Заявка_ат</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗначениеВыбораТарифногоПлана</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Клиент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты_ат</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоличествоДокумента</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОжидаемаяДатаЗавершения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Основание</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Согласование_ат</v8:Type>
						<v8:Type>cfg:DocumentRef.ФиксацияРабот_ат</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Проект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Проекты_ат</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатусСогласования</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыСогласований_ат</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаДокумента</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Тариф</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ВводТарифов_ат</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТарифныйПлан</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТекстСогласования</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипСогласования</Name>
					<Comment>!!!TODO - rename</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыСогласований_ат</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФлагВнутреннего</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ОбъектыСогласования</Name>
					<Comment>!!!!!HOTFIX</Comment>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Задание</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.Задание_ат</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Удалить_КоличествоДляОтображения</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>12</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СодержаниеРабот</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СодержанияРабот_ат</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПланируемоеВремяВыполнения</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ФактическоеВремяВыполнения</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Удалить_Согласование</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Дата</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сотрудник</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПоложительноеСогласование</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстПодтверждения</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СсылкаНаПодтверждение</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.ЭлектронноеПисьмоВходящее</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Согласующие</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ТипСогласования</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ТипыСогласований_ат</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Согласующий</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Согласовано</Name>
							<Type>
								<v8:Type>cfg:EnumRef.РешенияОСогласовании</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаВремяСогласования</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>DateTime</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОснованиеСогласования</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.ЭлектронноеПисьмоВходящее</v8:Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>150</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Комментарий</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>250</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>СодержаниеСогласования</Name>
					<Comment>!!!!!HOTFIX</Comment>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Удалить_КоличествоДляОтображения</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>12</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура_ат</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СодержаниеРабот</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СодержанияРабот_ат</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>13</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Удалить_Тариф</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.ВводТарифов_ат</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Удалить_ТарифныйПлан</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>13</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Enums/ТипыСогласований_ат.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<Enum>
		<Properties>
			<Name>ТипыСогласований_ат</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Техническое</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Финансовое</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ТехническоеИФинансовое</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПереносДат</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/РешенияОСогласовании.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<Enum>
		<Properties>
			<Name>РешенияОСогласовании</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Согласовано</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Отклонено</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/СтатусыСогласований_ат.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<Enum>
		<Properties>
			<Name>СтатусыСогласований_ат</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Подготовка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОжиданиеОтвета</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Принято</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Отклонено</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОбработкаОтвета</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Отменено</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Documents/Согласование_ат/Ext/ManagerModule.bsl
Процедура ОбработкаПолученияПолейПредставления(Поля, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Поля.Добавить("Номер");
	Поля.Добавить("Дата");
	Поля.Добавить("Заявка");
	
КонецПроцедуры

Процедура ОбработкаПолученияПредставления(Данные, Представление, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	Представление = "Согласование " + Число(Строки_КлиентСервер_ат.ВернутьТолькоЦифры(Данные.Номер))
		+ " от " + Формат(Данные.Дата, "ДФ=dd.MM.yy") + ?(Данные.Заявка.Пустая(), "", " (" + Данные.Заявка + ")");
	
КонецПроцедуры

Функция   ПолучитьИдентификаторВидаПисьмаДляАвтоматическойОбработки() Экспорт
	
	Возврат "Agreement-Doc";
	
КонецФункции

Функция   ВидПисьма() Экспорт
	
	Возврат "Agreement";
	
КонецФункции

Функция   ЗаполнитьДанныеДляОбработкиОтветногоПисьма(ПараметрыВходящегоПисьма) Экспорт
	
	Согласование = ПолучитьСогласованиеНаПриемкеПоНомеру(ПараметрыВходящегоПисьма.НомерДокумента);
	
	Если Согласование = Неопределено Тогда
		
		Возврат "Согласование №" + ПараметрыВходящегоПисьма.НомерДокумента + " не обнаружено!";
		
	ИначеЕсли ТипЗнч(Согласование) = Тип("ПеречислениеСсылка.СтатусыСогласований_ат") Тогда
		
		Возврат "Согласование №" + ПараметрыВходящегоПисьма.НомерДокумента + " имеет статус не предполагающий принятие по нему решения - " + Согласование; //!!!максировать внутренние статусы для клиентов;
		
	Иначе
		
		Взаимодействия.УстановитьПредмет(ПараметрыВходящегоПисьма.Письмо, ПараметрыВходящегоПисьма.ИсходящееПисьмо); //??? - см. док.Заявка_ат.ММ
			// ранее было - Согласование
			
	КонецЕсли;
	
	ПараметрыВходящегоПисьма.Вставить("Согласование", Согласование);
	
	ПараметрыВходящегоПисьма.Вставить("ПоложительноеРешение", ПолучитьРешениеПоПисьму(ПараметрыВходящегоПисьма.Ответ));
	
	ПараметрыВходящегоПисьма.Вставить("ВалидныеОтветчики", Согласование.Согласующие.ВыгрузитьКолонку("Согласующий"));
	
	Возврат "";
	
КонецФункции

Процедура ОбработатьАвтоматическоеУведомление(ПараметрыПисьма) Экспорт
	
	Если НЕ ПараметрыПисьма.Свойство("Ошибка") Тогда
		
		Попытка
			
			ТекстПисьма = ОбработчикиСобытийДляПочтовыхДокументов_ат.ПолучитьТексПисьмаИзРегистраСодержаниеЭлектронныхПисем(ПараметрыПисьма.Письмо);
			
			Если ПараметрыПисьма.Письмо.ТипТекста = Перечисления.ТипыТекстовЭлектронныхПисем.HTML Тогда
				ТекстПисьма = РаботаСHTML_КлиентСервер_ат.ПолучитьОбычныйТекстИзHTML(ТекстПисьма);
			КонецЕсли; 
			
			ВерныйПин = Истина;
			
			Если ПараметрыПисьма.Согласование.ТипСогласования = Перечисления.ТипыСогласований_ат.Финансовое Тогда
				
				ВерныйПин = Согласование_ат.ПроверитьПинКод(ТекстПисьма, ПараметрыПисьма);
				
			ИначеЕсли ПараметрыПисьма.Согласование.ТипСогласования = Перечисления.ТипыСогласований_ат.ТехническоеИФинансовое Тогда
				
				НайденныеСтроки = ПараметрыПисьма.Согласование.Согласующие.НайтиСтроки(
					Новый Структура("Согласующий", ПараметрыПисьма.Ответчик));
				
				Для Каждого НайденнаяСтрока Из НайденныеСтроки Цикл
					
					Если НайденнаяСтрока.ТипСогласования = Перечисления.ТипыСогласований_ат.Финансовое
						ИЛИ НайденнаяСтрока.ТипСогласования = Перечисления.ТипыСогласований_ат.ТехническоеИФинансовое Тогда
						
						ВерныйПин = Согласование_ат.ПроверитьПинКод(ТекстПисьма, ПараметрыПисьма);
						Прервать;
						
					КонецЕсли;
					
				КонецЦикла;
				
			КонецЕсли;
			
			Если НЕ ВерныйПин Тогда
				
				Уведомления_ат.ОтправитьАвтоответ(ПараметрыПисьма.Письмо, ПараметрыПисьма.Ошибка);
				
			Иначе
				
				Согласование_ат.УстановитьРешениеВСогласовании(ПараметрыПисьма.Согласование,
					?(ПараметрыПисьма.ПоложительноеРешение,
						Перечисления.РешенияОСогласовании.Согласовано,
						Перечисления.РешенияОСогласовании.Отклонено),
					ПараметрыПисьма.Ответчик, ПараметрыПисьма.Письмо,
					ТекстПисьма, Истина);
				
			КонецЕсли;
			
			Уведомления_ат.СнятьСКонтроляПисьмаПоЗаявке(ПараметрыПисьма.Согласование); //!!!TODO - когда потом на Закрытие это уйдёт не нужно будет снимать контроль сразу по всей заявке (это используется только тут)
			//Уведомления_ат.ЗаписатьСведенияОКонтролеЭлектронногоПисьма(ПараметрыПисьма.ИсходящееПисьмо, Ложь);
			Уведомления_ат.УстановитьРассмотренностьПисьма(ПараметрыПисьма.Письмо, Ложь); // а это надо после предыдущего??
			
		Исключение
			
			ПараметрыПисьма.Вставить("Ошибка", ОписаниеОшибки());
			
		КонецПопытки;
		
	КонецЕсли;
	
	//Если ПараметрыПисьма.Свойство("Ошибка") Тогда //!!!!!TODO - переписать такую кривоту
	//	
	//	Уведомления_ат.УведомитьОПолучениПисьмаОСогласовании(ПараметрыПисьма.Согласование, ПараметрыПисьма);
	//	
	//КонецЕсли;
	
КонецПроцедуры

Функция   ПолучитьСогласованиеНаПриемкеПоНомеру(НомерСогласования)
	
	Запрос = Новый Запрос(
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	Согласование_ат.Ссылка,
		|	Согласование_ат.СтатусСогласования
		|ИЗ
		|	Документ.Согласование_ат КАК Согласование_ат
		|ГДЕ
		|	Согласование_ат.Номер = &Номер
		|	И НЕ Согласование_ат.ПометкаУдаления
		|");
	Запрос.УстановитьПараметр("Номер", НомерСогласования);
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		
		Возврат Неопределено;
		
	Иначе
		
		Выборка = РезультатЗапроса.Выбрать();
		Выборка.Следующий();
		
		Если Выборка.СтатусСогласования = Перечисления.СтатусыСогласований_ат.ОжиданиеОтвета Тогда
			Возврат Выборка.Ссылка;
		Иначе
			Возврат Выборка.СтатусСогласования;
		КонецЕсли;
		
	КонецЕсли;
	
КонецФункции

Функция   ПолучитьРешениеПоПисьму(Ответ)
	
	Если Врег(Ответ) = "ACCEPT" Тогда
		Возврат Истина;
	ИначеЕсли Врег(Ответ) = "DECLINE" Тогда
		Возврат Ложь;
	Иначе
		Возврат Неопределено;
	КонецЕсли;
	
КонецФункции
